<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fb072b802475c9b1f1e8cd261ac2580656cd24e08a547cdfac0a3c199a2560ae","plan_job_ref":"Job Run Terraform plan in staging #184 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13392636381","plan_out_hash":"22a55701e8563c65e66cb55296f94c6f9fd8f537cfa1df355548fe9b7b7ea18e","plan_hash":"d4df83995e3b585f535079cb3a91e40bd640fd778b420508539856b20153bde6","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "pji4RApRwHZ2w1h8XWBreA8XLCDXu6bukiSWWI+CmlM=" -> "SAXjqM+hG9pRil77zkKX1xSuWaMjSeiN9vf8f9msqnk="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-02-12T13:58:17Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #184](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13392636381)